Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff
Part position XYZ difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff.#ctor(Tekla.Structures.Identifier,Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.ObjectDiffEnum,System.Int32,Tekla.Structures.Geometry3d.Vector,Tekla.Structures.Geometry3d.Point,Tekla.Structures.Geometry3d.Point)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff class.
id: The object identifier.
type: The object difference type.
posIndex: The position index.
delta: The position difference vector.
physicalPosition: The physical position.
analysisPosition: The analysis position.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff.PosIndex
Gets the position index.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff.Delta
Gets the position difference vector.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff.PhysicalPosition
Gets the physical position.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartPositionXyzDiff.AnalysisPosition
Gets the analysis position.